// Во една компанија сите вработени користат еден централизиран систем, 
//за кој им е креирана корисничка сметка. Корисничко име(username) 
//на секој вработен се добива откако од матичниот број на вработениот
// ќе се земат деловите кои го даваат датумот на раѓање и ќе се пресмета вредноста:
// ден * 100 + месец * 1000 + година
// Така ако делот од матичниот број кој го дава датумот е 1103998, 
//тогаш се добива 11 * 100 + 3 * 1000 + 1998 = 6098.
// Доколку бројот кој ќе се добие по пресметката е петцифрен, тогаш тоа е корисничкото име.
// Во спротивно, доколку е четирицифрен, тогаш се додава првата цифра да биде:
// 7 - доколку годината на раѓање е до 1960
// 8 - доколку годината на раѓање е помеѓу 1961 - 1980
// 9 - доколку годината на раѓање е помеѓу 1981 - 1999
// Напомена: Се смета дека сите вработени се родени до 1999 година.
// Програмата го враќа ваквото корисничко име за внес од тастатура 
// кој е дел од матичниот број на некој вработен, како во примерот.


#include <stdio.h>

int main(){
    int mb;
    scanf("%d",&mb);
    int suma = 0;
    suma+=(mb/100000)*100;
    suma+=(mb/1000)%100*1000;
    suma+=1000+mb%1000;
    if(suma<10000){
        if(mb%100<=60){
            suma+=7*10000;
        }
        else if(mb%100<=80){
            suma+=8*10000;
        }
        else{
            suma+=9*10000;
        }   
    }
    printf("%d",suma);

    return 0;
}