// Дефинираме вредност d за тројка цели броеви a, b и c , 
// така што таа се пресметува како сума меѓу апсолутните разлики од првиот и вториот број,
// од една страна, и вториот и третиот број, од друга страна:
// d = |(a-b)| + |(b-c)|
// Да се напише програма со којашто од тастатура се вчитуваат N тројки цели броеви 
//(N се внесува од тастатура), и која што ја наоѓа и ја печати најмалата вредност за d од прочитаните тројки.

#include <stdio.h>
#include <stdlib.h>
#define MAX =

int main(){
    int n;
    int min=0;
    scanf("%d",&n);
    for(int i=0; i<n; i++){
        int a,b,c;
        scanf("%d %d %d",&a,&b,&c);
        int d = abs(a-b)+abs(b-c);
        if(i==0){
            min = d;
            continue;
        }
        if(d<min) min = d;
    }
    printf("%d",min);
    return 0;
}