// Во играта Бинго по редослед се извлекуваат непознат број броеви со вредности помеѓу 1 и 90.
// Секогаш се извлекуваат повеќе од 8 броја. 
// Претпоставете дека внесувањето престанува кога ќе се внесе број кој не е во опсегот вредности.
// Освен главната добивка, играчите играат и на џокер број. Џокер бројот се формира на следниот начин: 
// Се слепуваат помалку значајните цифри од првите 7 извлечени броја, 
// и на тој број се додаваат сите следни внесени броеви. 
// Ваша задача е да го отпечатите така добиениот џокер број.

#include <stdio.h>

int main(){
    int joker=0,brojac=0;
    while(1){
        int br;
        scanf("%d",&br);
        if(br<1 || br>90) break;
        if(brojac<7){
            joker+=br%10;
            joker*=10;
            if(brojac==6) joker/=10;
        }
        else joker+=br;
        brojac++;
    }
    printf("%d",joker);

}