// Empires & Allies е стратегиска игра во повеќе нивоа со можност за играње од
// страна на повеќе играчи. Секој играч има своја територија, како и одбранбени
// и напаѓачки единици. Може да влезе во битка (напад на туѓа територија или
// одбрана на сопствената) со други играчи што може да заврши со победа или
// пораз за што се добиваат поени. Да се напише програма во која од тастарура се
// внесува бројот на играчи на играта Empires & Allies. За секој играч потоа се
// внесуваат податоци за ниво (цел број), број на победи и број на порази.
// Резултатот на играчот се пресметува на следниот начин:
// • ако се работи за прво ниво, секоја победа носи 13 поени, а секој пораз носи -1
// поен
// • ако се работи за второ ниво, секоја победа носи 13 поени, а секој пораз носи
// -3 поени
// За секој играч треба да се испечати Dobar igrac ако неговиот број на поени е
// позитивен или Los igrac во сите други случаи. Потоа треба да се најде и
// испечати најдобриот резултат (најголемиот вкупен број на поени), како и
// редниот број на играчот со најдобар резултат (првиот играч е со реден број
// еден, вториот со реден број два итн.). Ако постојат повеќе играчи со ист
// најдобар резултат, да се испечати редниот број на првиот таков играч.

#include <stdio.h>

int main(){
    int n,maks=-100,broj=0;
    scanf("%d",&n);
    for(int i=1;i<=n;i++){
        int nivo,pobedi,porazi;
        scanf("%d %d %d",&nivo,&pobedi,&porazi);
        if(nivo == 2) nivo = 3;
        int poeni = pobedi*13 - porazi*nivo;
        if(poeni>maks){
            maks=poeni;
            broj = i;
        }
        if(poeni>0) printf("Dobar igrac");
        else printf("Los igrac");
    }
    printf("Najdobar Igrac: br. %d, %d poeni",broj,maks);
    return 0;
}