// Со помош на знаците +, , и % се формира квадратна слика со „должина“ m
// (m>2) која претставува квадрат од знаците %, впишан во квадрат од
// знаците + и (види примери). За внесено m да се испечати на екран
// соодветната слика. Внимавајте – не печатете нити еден дополнителен знак,
// како празно место, непотребен знак за нов ред… Сликата завршува со знак за нов ред.

#include <stdio.h>

int main(){
    int m;
    scanf("%d",&m);
    for(int i=0;i<m;i++){
        for(int j=0;j<m;j++){
            if(j==0) printf("+");
            else if(j==m-1) printf("+\n");
            else if(i==0 || i==m-1) printf("*");
            else printf("%%");
        }
    }
    return 0;
}
