// Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:
// индекс (шестцифрен цел број)
// шест оценки од последниот семестар кој го слушал
// Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот: 
// просек на студентот
// просекот да се испечати со точност од 3 децимали
// година на студии
// студентите чијшто индекс почнува на 17 се трета година, на 16 се четврта година, на 15 се петта година итн.
// дали е награден (1 = награден, 0 = не е награден)
// Еден студент се наградува доколку има просек еднаков или поголем од 9.5

#include <stdio.h>

int main(){
    int indeks,o1,o2,o3,o4,o5,o6;
    scanf("%d%d%d%d%d%d%d",&indeks,&o1,&o2,&o3,&o4,&o5,&o6);
    int startIndeks = indeks;
    indeks/=10000;
    int godina = 3;
    godina+=17-indeks;
    float prosek = (o1+o2+o3+o4+o5+o6)/6.0;
    int nagraden = prosek >= 9.5;
    printf("Prosek: %.3f\n",prosek);
    printf("Student: %d\n",startIndeks);
    printf("%d godina\n",godina);
    printf("Nagraden: %d\n",nagraden);
    return 0;
}