// Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), 
// како и елементите на матрицата со димензии M x N (цели броеви).
// Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:
// Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
// Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
// Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0

#include <stdio.h>

int main(){
    int x,m,n;
    scanf("%d%d%d",&x,&m,&n);
    int matrica[m][n];
    for(int i=0;i<m;i++){
        int sum = 0;
        for(int j=0;j<n;j++){
            int temp;
            scanf("%d",&temp);
            sum += temp;
        }
        if(sum>x){
            for(int j=0;j<n;j++){
                matrica[i][j]=1;
            }
        }else if(sum<x){
            for(int j=0;j<n;j++){
                matrica[i][j]=-1;
            }
        }else{
            for(int j=0;j<n;j++){
                matrica[i][j]=0;
            }
        }
    }
    for(int i=0;i<m;i++){
        for(int j=0;j<n;j++){
            printf("%d ",matrica[i][j]);
        }
        printf("\n");
    }
    return 0;
}