// Од тастатура се внесуваат димензиите на една матрица (m,n <= 100), 
// а потоа и елементите од матрицата. 
// Да се трансформира матрицата така што средниот елемент во секоја редица ќе се замени со разликата 
// (по апсолутна вредност) на сумата на елементите во првата половина од редицата 
// и сумата на елементите во втората половина на редицата. Ако матрицата има парен број колони, 
// се менува вредноста на средните два елемента. Средниот/те елемент/и влегува/ат во сумите 
// (при непарен број на колони, средниот елемент влегува во двете суми!). 
// Да се испечати на екран променетата матрица.

#include <stdio.h>
#include <math.h>

int main(){
    int m,n;
    scanf("%d%d",&m,&n);
    int matrica[m][n];
    for(int i=0;i<m;i++){
        int sum1=0,sum2=0;
        for(int j=0;j<n;j++){
            scanf("%d",&matrica[i][j]);
            if(n%2==1){
                if(j<=n/2) sum1+=matrica[i][j];
                if(j>=n/2) sum2+=matrica[i][j];
            }else{
                if(j<n/2) sum1+=matrica[i][j];
                if(j>=n/2) sum2+=matrica[i][j];
            }
        }
        if(n%2==1){
            matrica[i][n/2] = fabs(sum1-sum2); 
        }else{
            matrica[i][n/2] = fabs(sum1-sum2);         
            matrica[i][n/2-1] = fabs(sum1-sum2);         
        }
    }
    for(int i=0;i<m;i++){
        for(int j=0;j<n;j++){
            printf("%d ",matrica[i][j]);
        }
        printf("\n");
    }
    return 0;
}