// Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100), 
// а потоа се внесува и цел број ind (ind >= 0).
// Да се напише функција sum_pos која ја прима низата, 
// бројот ind (кој претставува индекс во низата) и бројот на валидни елементи во низата. 
// Функцијата треба да врати сумата на сите елементи почнувајќи од дадениот индекс ind 
// па се до крајот на низата. Ако индексот ind е поголем од Nфункцијата треба да врати 0.
// НАПОМЕНА: Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).

#include <stdio.h>
#include <malloc.h>

int main(){
    int n;
    scanf("%d\n",&n);
    int *niza = malloc(n);
    for(int i=0;i<n;i++){
        scanf("%d\n",(niza+i));
    }
    int ind;
    scanf("%d\n",&ind);
    if(ind>=n){
        printf("0");
        return 0;
    }
    int suma=0;
    for(int i=ind;i<n;i++){
        suma+=*(niza+i);
    }
    printf("%d",suma);

    return 0;
}