// Од стандарден влез се чита цел број N. 
// Потоа се вчитуваат N низи од цели броеви (со максимална должина од 100 елементи), 
// при што за секоја прво се внесува должината на низата, а потоа сите елементи на низата.
// Да се напише програма која за секоја низа 
// ќе го испечати процентот на огледални еднакви броеви во низата. 
// Огледални броеви во низа се првиот и последниот, вториот и претпоследниот итн. 
// Доколку низата има непарен број на елементи, средниот елемент е и огледален и еднаков.

#include <stdio.h>

int main(){
    int n;
    scanf("%d",&n);
    int matrica[n][100];
    for(int i=0;i<n;i++){
        int golemina;
        scanf("%d",&golemina);
        for(int j=0;j<golemina;j++){
            scanf("%d",&matrica[i][j]);
        }
        int ogledalni = 0;
        for(int j=0;j<golemina;j++){
            if(matrica[i][j]==matrica[i][golemina-j-1]) ogledalni++;
        }
        printf("%.2f%%\n",(float) ogledalni/golemina*100);
    }
    return 0;
}