// Да се напише програма во која од тастатура се читаат број на редици и колони 
// (не поголеми од 100) и елементи на матрица (цели броеви).
// Да се испечати редниот број на колоната (индексот) којашто има најмала сума на елементите. 
// Ако има повеќе колони со иста најмала сума, да се испечати индексот на првата таква колона.
// Читањето на елементи во матрицата да се направи преку функција
// void readMatrix(int a[100][100], int n, int m)

#include <stdio.h>

void readMatrix(int a[100][100], int n, int m){
    for(int i=0;i<n;i++){
        for(int j=0;j<m;j++){
            scanf("%d",&a[i][j]);
        }
    }
}

int main(){
    int a[100][100],n,m;
    scanf("%d %d",&n,&m);
    readMatrix(a,n,m);
    int min = 10000,poz=0;
    for(int i=0;i<m;i++){
        int suma = 0;
        for(int j=0;j<n;j++){
            suma+=a[j][i];
        }
        if(suma<min){
            min = suma;
            poz = i;
        }
    }
    printf("%d",poz);

    return 0;
}