# Задача 1. Креирајте вектор со вредности од 1 до 6. Од овој вектор да се направи матрица со
# димензии 2x3. Испишете ги димензиите на матрицата. Потоа додадете имиња на секоја
# колона и редица. Додадете имиња за секој елемент од матрицата посебно. На крај
# испечатете ја матрицата.

v = seq(1,6)
v = matrix(v,2,3)
colnames(v) = c("a","b","c")
rownames(v) = c("a","b")
v

# Задача 2. Зададете две 3x3 матрици и помножете ги. Потоа првата редица од резултатот
# зачувајте ја во посебен вектор. Во друг вектор зачувајте ги сите елементи од матрицата кои
# се поголеми од 4. 

a = matrix(seq(1,9),3,3)
b = matrix(seq(1,9),3,3)
c = a*b
d = c[1,]
e = c[c>4]

# Задача 3. Да се напише функција којашто ќе најде просечна вредност од елементите во
# произволна редица/колона на произволна матрица. Да се спореди резултатот со примена на
# функцијата mean().

f <- function(x){
  sum(x)/length(x)
}
x = seq(1,6,0.5)
f(x) == mean(x)


# Задача 4. Да се напише скрипта со помош на некоја од контролните структури во која ќе се
# одвојат броевите (од некој произволен вектор) кои се поголеми и помали од 1 во посебни
# вектори. Дали би можело да се најде поедноставно решение со користење на некои од
# готовите функции на R? 

x = seq(-2,6,0.5)
x[x<1]
x[x>1]

  