# Задача 1.
# Следните податоци внесете ги во два вектори ( директно во R, преку Excel и .txt ). Обработете
# ги комплетно податоците – најдете дескриптивни статистики, хистограм, boxplot, scatterplot.
# 70 , 36, 43, 69, 82, 48, 34, 62, 35, 15, 59, 139, 46, 37, 42, 30, 55, 56, 36, 82, 38,
# 89, 54, 25, 35, 24, 22, 9, 56, 19
# 7.2, 22.1, 18.5, 17.2, 18.6, 14.8, 21.7, 15.8, 16.3, 22.8, 24.1, 13.3, 16.2,
# 17.5, 19.0, 23.9, 14.8, 22.2, 21.7, 20.7, 13.5, 15.8, 13.1, 16.1, 21.9, 23.9,
# 19.3, 12.0, 19.9, 19.4
# Користете ги и посложените параметри при дефинирање на наредбите. Кај хистограмот
# изберете го соодветниот број на колони, според формулата од предавањe

x = c(70 , 36, 43, 69, 82, 48, 34, 62, 35, 15, 59, 139, 46, 37, 42, 30, 55, 56, 36, 82, 38,
      89, 54, 25, 35, 24, 22, 9, 56, 19 )
y = c(7.2, 22.1, 18.5, 17.2, 18.6, 14.8, 21.7, 15.8, 16.3, 22.8, 24.1, 13.3, 16.2,
      17.5, 19.0, 23.9, 14.8, 22.2, 21.7, 20.7, 13.5, 15.8, 13.1, 16.1, 21.9, 23.9,
      19.3, 12.0, 19.9, 19.4 )

mean(x);sd(x);IQR(x);max(x);min(x);var(x);
mean(y);sd(y);IQR(y);max(y);min(y);var(y);

hist(x)
hist(y)
boxplot(x)
boxplot(y)
plot(x)
plot(y)

# Задача 2.
# Х : 1 2 3 4 5 6 7 8 9 10
# У : 1.658131 3.008234 3.667983 6.190716 9.408087 10.582197 13.748631
# 15.394779 18.865287 18.326764
# Нацртајте scatterplot за овие податоци. Дали графикот укажува на некаква зависност на
# податоците? Побарајте го и коефициентот на корелација користејќи ја наредбата cor(). Дали
# постои зависност помеѓу податоците? На оваа задача навратете се и на крајот од
# предавањата и нацртајте ја правата за линеарна регресија.


x = c(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
y = c(1.658131, 3.008234, 3.667983, 6.190716, 9.408087, 10.582197, 13.748631,
15.394779, 18.865287, 18.326764) 


cor(x,y)