// Да се напише рекурзивна функција која што прима еден аргумент - 
// број x која што ќе враќа 1 доколку секоја цифра во бројот е поголема од претходната, а во спротивно 0.
// Пример бројот 12345 е растечки, додека пак бројот 12325 не е растечки број.
// Од стандарден влез се вчитува прво број N, а потоа N броеви. 
//За секој број да се испечати порака DA или NE (во нов ред), доколку бројот е растечки или не е растечки.

#include <stdio.h>


int rastecki(int broj){
    if(broj<10) return 1;
    if(broj<100) return broj%10>broj/10%10;
    return broj%10>broj/10%10 == rastecki(broj/10) ? broj%10>broj/10%10 : 0;
}

int main(){
    int n;
    scanf("%d",&n);
    for(int i=0;i<n;i++){
        int broj;
        scanf("%d",&broj);
        rastecki(broj) ? printf("DA\n") : printf("NE\n");
    }
    return 0;
}

