// Од тастатура се читаат 2 позитивни цели броеви.
// Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.
// Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
// Еден број “е парен еквивалент” на друг број, 
// ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, 
// во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.
// Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)

#include <stdio.h>

int main(){
    int br1,br2;
    scanf("%d%d",&br1,&br2);
    if(br1<=0 || br2<=0){
        printf("Invalid input");
        return 0;
    }

    int mal,golem;
    if(br1>br2){
        golem=br1;
        mal=br2;
    }else{
        golem=br2;
        mal=br1;
    }
    while(golem!=0){
        golem/=10;
        if(mal%10!=golem%10){
            printf("NE");
            return 0;
        }
        golem/=10;
        mal/=10;
        
    }
    printf("PAREN");
    return 0;
}