// Од стандарден влез се внесуваат два цели броја N и Х.
// Да се најде најблискот број помал од N коj е тотално различен од бројот Х.
// Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.
// Задачата да се реши без употреба на низи и матрици.


#include <stdio.h>

int main(){

    int n,x;
    scanf("%d%d",&n,&x);
    n--;
    for(n;n>0;n--){
        int ista = 0;
        for(int phN=n;phN!=0;phN/=10){
            for(int phX=x;phX!=0;phX/=10){
                if(phN%10==phX%10) ista = 1;
            }
        }
        if(!ista) break;
    }
    printf("%d",n);

    return 0;
}