# Практичен R февруари 2020 Г1
# Задача 1. (2) Во една амбуланта секој час пристигнуваат пациенти со рата 10 на час. Симулирајте 100 вредности од случајната променлива која го опишува овој процес. Која е оценката за очекуваниот број на пациенти? Која е теориската веројатност дека во наредниот час ќе дојдат 15 пациенти?

X = rpois(100,10)
log.l <- function( lambda= 7){
  r=dpois(X, lambda);
  -sum(log(r));
}
library(stats4);
mle(log.l)
teor <- (10^15 * exp(-10)) / factorial(15)
teor
funk <- dpois(15,10)
funk


# Задача 2.  Време на преглед за секој пациент е случајна променлива  Y. Во една амбуланта добиен е следниот примерок за Y
# c(1.13,1.83, 13.14, 41.22, 27.19,  7.13,  6.94, 24.22, 31.77,  1.03,  7.80, 26.90,  2.27,  3.21, 19.01,  5.98,  6.57, 9.47,  1.29,  6.99, 28.12,  6.13, 13.91, 21.37, 12.23,  7.29, 13.93, 40.32,  0.17,  7.23,  4.44,  3.59,  0.16, 22.27, 7.32,  4.82,  6.04,  3.80,  3.23,  6.04)

Y = c(1.13,1.83, 13.14, 41.22, 27.19,  7.13,  6.94, 24.22, 31.77,  1.03,  7.80, 26.90,  2.27,  3.21, 19.01,  5.98,  6.57, 9.47,  1.29,  6.99, 28.12,  6.13, 13.91, 21.37, 12.23,  7.29, 13.93, 40.32,  0.17,  7.23,  4.44,  3.59,  0.16, 22.27, 7.32,  4.82,  6.04,  3.80,  3.23,  6.04)

min(Y);max(Y);mean(Y);median(Y);sd(Y);var(Y);range(Y);IQR(Y);quantile(Y);sum(Y);
hist(Y)

log.m <- function(lambda = 7){
  r = dexp(Y,lambda)
  -sum(log(r))
}
library(stats4);
mle(log.m)
#lambda = 0.087 spored MPO

lambda = 0.087
#pravime Kolmogorov smirnov test za r-ba bidekji Y e od ANT
#h0: Y ima eksp r-ba
#ha: Y nema eksp r-ba
ks.test(Y, "pexp", lambda)
#PVAL=0.4854>0.05;h0 se prifakja; Y ima eksp r-ba

#h0: mu = 20
#h1: mu != 20
t.test(Y, alt="two.sided",mu=20,cong.level=0.95)


#Задача 3. (2) Од Grouper  ги имаме следните податоци: од 12 зделки за кои се продадени над 200 ваучери, 5 се со попусти над 50%, а 7 под 50%. Од 24-те зделки за кои биле продадени од 0 до 199 ваучери, 16 биле со попусти под 50%, а останатите со попуст над 50 %. Ако случајната променлива Х е процент на попуст, а У број на продадени ваучери, со ниво на значајност 0.05, тестирај дали постои зависност меѓу нив. 

#X- br na popust
#Y- br na prodadeni vauceri
pod <- matrix(c(7,16,5,8), 2,2, byrow=T)
dimnames(pod) <- list(c("pod 50", "nad 50"), c(">200", "0-199"))
pod

#so hi kvadrat testirame nez na obelezja
#h0: Xi Y se nez
#ha: X i Y se zavisni
chisq.test(pod, correct=FALSE)
#pval = 0.6236>0.05 ;se prifakja h0; nezavisni se


# juni 2017
# 1. (2+3) а) Вп кутија има еднп белп и 10 црни тппчиоа. Еден експеримент се спстпи пд влечеое на
# еднп тппче сп враќаое, се’ дпдека не се извлече белптп тппче. Нека X е случајната прпменлива
# кпја гп дава брпјпт на влечеоа вп еден експеримент.
# а) Да се направат 50 симулации на експериментпт и статистички да се пбрабптат.
# б) Од дпбиенипт примерпк да се најде интервал на дпверба за прпсечнипт брпј на влечеоа вп
# еден експеримент. Да се пдгпвпри дали теприската вреднпст ЕХ се напда вп интервалпт на
# дпверба. Да се тестира хипптезата дека прпсечнипт брпј на влечеоа дп ппјавуваое на белптп
# тппче е 5.

x <- rgeom(50,1/11)
min(x);max(x);mean(x);median(x);sd(x);var(x);range(x);IQR(x);quantile(x);sum(x);
interval = function(t,alpha){
  m = mean(t)
  s = sd(t)
  n = length(t)
  z = qnorm(1-alpha/2)
  c(m-z*s/sqrt(n),m+z*s/sqrt(n))
}
interval(x,0.95)
mean(x)

#h0: mu = 5
#ha: mu!=5
t.test(x,alt="two.sided",mu=5,conf.level=0.95)
# se prifakja ha

#2. (1/2.5) На еден сервер пристигнуваат ппраки на случаен начин, при штп вп ист мпмент не
# пристигнува ппвеќе пд една ппрака. Дадени се времиоата на чекаое ппмеду ппследпвателнп
# пристигнати ппраки.
# x=c(0.053, 0.246, 0.528, 0.233, 0.161, 1.749,0.690, 0.097, 0.839, 0.122, 0.093, 0.525, 0.952, 1.601,1.059,
#   0.395, 1.286, 0.0143,0.009, 0.268, 0.0334, 0.807, 0.102, 0.043, 0.795, 0.280, 0.067, 0.747, 0.449, 0.060,
#   0.395, 0.079, 0.365, 1.379, 0.042, 0.560, 0.205, 1.099, 1.444, 0.832)

X <- c(0.053, 0.246, 0.528, 0.233, 0.161, 1.749,0.690, 0.097, 0.839, 0.122, 0.093, 0.525, 0.952, 1.601,1.059,0.395, 1.286, 0.0143,0.009, 0.268, 0.0334, 0.807, 0.102, 0.043, 0.795, 0.280, 0.067, 0.747, 0.449, 0.060,0.395, 0.079, 0.365, 1.379, 0.042, 0.560, 0.205, 1.099, 1.444, 0.832)
hist(X)
# momenti
l = mean(X)
1/l

# maksimalna podobnost
log.l <- function( lambda= 1){
  r=dexp(X, lambda);
  -sum(log(r));
}
library(stats4);
mle(log.l)

#3. (2.5) Завпдпт за статистика сака да направи испитуваое дали зарабптувачката на младите е
# независна пд степенпт на пбразпвание. Сп испитуваое на случаен примерпк пд 300 млади на
# впзраст пд 30 гпдини ја дпбиле следната табела
# Штп заклучиле вп Завпдпт за статистика?

X = matrix(c(82,74,48,96),2,2,byrow = T)
chisq.test(x,correct = T)
# p-val > alfa, h0 se prifakja


