// Од тастатура се чита еден непарен цел број n кој е поголем или еднаков на 5. 
// Со помош на знакот * да се исцрта песочен часовник, кој има основи со должина n, 
// како што е во примерот подолу, за n=5:
// *****
//  * * 
//   *
//  * *
// *****


#include <stdio.h>

int main(){
    int m;
    scanf("%d",&m);
    for(int i=0;i<m;i++){
        for(int j=0;j<m;j++){
            if(i==0 || i==m-1 || i==j || j==m-1-i) printf("*"); 
            else printf(" ");
            if(j==m-1) printf("\n");
        }
    }
}