// Да се напише код којшто од стандарден влез ќе чита информации за една фискална сметка на следниов начин
// напрво се чита број N
// потоа ќе читаат уште N парови на вредности од следниот формат: износ тип_на_данаок
// пр. 5 100 А 50 B 66 A 77 B 88 V
// што првата вредност во парот изнесува износот на некој купен артикал, 
// додека пак втората вредност е карактер (A, B, V) 
// што означува каков тип на данок на додадена вредност се пресметува за тој артикал:
// А означува 18%
// B означува 5%
// V означува 0%
// Да се испечати на стандарден излез колку ќе изнесува повратокот на ДДВ за фискалната сметка
// што е вчитана од стандарден влез. Повратокот на ДДВ се пресметува како 15% од вкупно наплатеното ДДВ.

#include <stdio.h>

int main(){
    int parovi;
    float total = 0.0;
    scanf("%d",&parovi);
    for(parovi;parovi>0;parovi--){
        int suma;
        char znak;
        float danok;
        scanf("%d %c",&suma,&znak);
        if(znak=='A') danok = suma*0.18;
        if(znak=='B') danok = suma*0.05;
        if(znak=='V') danok = 0;

        total+=(danok*0.15);
    }

    printf("Total tax return is: %.2f",total);
    return 0;
}
